from aiogram.utils.formatting import Bold, as_list, as_marked_section


categories = ['Еда', 'Напитки', 'Соусы', 'Закуски']

description_for_info_pages = {
    "main": "Добро пожаловать!",
    "about": as_marked_section(Bold('Жральня'),
                               "Режим работы - пн-пт с 00:00 до 7:45",marker='🤪 ').as_html(),
    "payment": as_marked_section(Bold("Варианты оплаты:"),
        "Безналичная (QR или картой)",
        "Наличная (Рубли/юани)",
        "Кровью (За заказ придется биться)",
        "Также плотно принимаем биток для отмыва ! :) ",
        marker="✅ ",).as_html(),
    "shipping":as_marked_section(
        Bold("Варианты доставки/заказа:"),
        "Курьер",
        "Самовывоз (легчайшая сотка)",
        marker="✅ ",).as_html(),
    'catalog': 'Категории:',
    'cart': 'В корзине ничего нет!',
    'registration':'Выберите опцию:',
    'order':'Ваш заказ:',
    'pickup': 'Выберите пункт выдачи:',
}


currentbranches  = (
    {
        'name': 'Жральня',
        'address': 'Пушкина Калатушкина 3',
        'description': 'Режим работы - пн-пт с 00:00 до 7:45',
        'phone': '+78005553535',
        'branch_id': '337',
        'image':None,
    },
    {
        'name': 'Жральня 2',
        'address': 'Площадь Путина 15',
        'description': 'Режим работы - пн-пт с 00:00 до 7:45',
        'phone': '+78005553335',
        'branch_id': '488',
        'image': None,
    }
)